_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 720, 768)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 3, 722, 770)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 32, 360, 384)      864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 32, 360, 384)      128       
_________________________________________________________________
conv1_relu (Activation)      (None, 32, 360, 384)      0         
_________________________________________________________________
conv2_1_dw (DepthwiseConv2D) (None, 32, 360, 384)      288       
_________________________________________________________________
conv2_1_dw_bn (BatchNormaliz (None, 32, 360, 384)      128       
_________________________________________________________________
conv2_1_dw_relu (Activation) (None, 32, 360, 384)      0         
_________________________________________________________________
conv2_1_sep (Conv2D)         (None, 64, 360, 384)      2048      
_________________________________________________________________
conv2_1_sep_bn (BatchNormali (None, 64, 360, 384)      256       
_________________________________________________________________
conv2_1_sep_relu (Activation (None, 64, 360, 384)      0         
_________________________________________________________________
conv2_2_dw (DepthwiseConv2D) (None, 64, 180, 192)      576       
_________________________________________________________________
conv2_2_dw_bn (BatchNormaliz (None, 64, 180, 192)      256       
_________________________________________________________________
conv2_2_dw_relu (Activation) (None, 64, 180, 192)      0         
_________________________________________________________________
conv2_2_sep (Conv2D)         (None, 128, 90, 96)       8192      
_________________________________________________________________
conv2_2_sep_bn (BatchNormali (None, 128, 90, 96)       512       
_________________________________________________________________
conv2_2_sep_relu (Activation (None, 128, 90, 96)       0         
_________________________________________________________________
conv3_1_dw (DepthwiseConv2D) (None, 128, 90, 96)       1152      
_________________________________________________________________
conv3_1_dw_bn (BatchNormaliz (None, 128, 90, 96)       512       
_________________________________________________________________
conv3_1_dw_relu (Activation) (None, 128, 90, 96)       0         
_________________________________________________________________
conv3_1_sep (Conv2D)         (None, 128, 90, 96)       16384     
_________________________________________________________________
conv3_1_sep_bn (BatchNormali (None, 128, 90, 96)       512       
_________________________________________________________________
conv3_1_sep_relu (Activation (None, 128, 90, 96)       0         
_________________________________________________________________
conv3_2_dw (DepthwiseConv2D) (None, 128, 45, 48)       1152      
_________________________________________________________________
conv3_2_dw_bn (BatchNormaliz (None, 128, 45, 48)       512       
_________________________________________________________________
conv3_2_dw_relu (Activation) (None, 128, 45, 48)       0         
_________________________________________________________________
conv3_2_sep (Conv2D)         (None, 256, 23, 24)       32768     
_________________________________________________________________
conv3_2_sep_bn (BatchNormali (None, 256, 23, 24)       1024      
_________________________________________________________________
conv3_2_sep_relu (Activation (None, 256, 23, 24)       0         
_________________________________________________________________
conv4_1_dw (DepthwiseConv2D) (None, 256, 23, 24)       2304      
_________________________________________________________________
conv4_1_dw_bn (BatchNormaliz (None, 256, 23, 24)       1024      
_________________________________________________________________
conv4_1_dw_relu (Activation) (None, 256, 23, 24)       0         
_________________________________________________________________
conv4_1_sep (Conv2D)         (None, 256, 23, 24)       65536     
_________________________________________________________________
conv4_1_sep_bn (BatchNormali (None, 256, 23, 24)       1024      
_________________________________________________________________
conv4_1_sep_relu (Activation (None, 256, 23, 24)       0         
_________________________________________________________________
conv4_2_dw (DepthwiseConv2D) (None, 256, 12, 12)       2304      
_________________________________________________________________
conv4_2_dw_bn (BatchNormaliz (None, 256, 12, 12)       1024      
_________________________________________________________________
conv4_2_dw_relu (Activation) (None, 256, 12, 12)       0         
_________________________________________________________________
conv4_2_sep (Conv2D)         (None, 512, 6, 6)         131072    
_________________________________________________________________
conv4_2_sep_bn (BatchNormali (None, 512, 6, 6)         2048      
_________________________________________________________________
conv4_2_sep_relu (Activation (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_1_dw (DepthwiseConv2D) (None, 512, 6, 6)         4608      
_________________________________________________________________
conv5_1_dw_bn (BatchNormaliz (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_1_dw_relu (Activation) (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_1_sep (Conv2D)         (None, 512, 6, 6)         262144    
_________________________________________________________________
conv5_1_sep_bn (BatchNormali (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_1_sep_relu (Activation (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_2_dw (DepthwiseConv2D) (None, 512, 6, 6)         4608      
_________________________________________________________________
conv5_2_dw_bn (BatchNormaliz (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_2_dw_relu (Activation) (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_2_sep (Conv2D)         (None, 512, 6, 6)         262144    
_________________________________________________________________
conv5_2_sep_bn (BatchNormali (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_2_sep_relu (Activation (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_3_dw (DepthwiseConv2D) (None, 512, 6, 6)         4608      
_________________________________________________________________
conv5_3_dw_bn (BatchNormaliz (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_3_dw_relu (Activation) (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_3_sep (Conv2D)         (None, 512, 6, 6)         262144    
_________________________________________________________________
conv5_3_sep_bn (BatchNormali (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_3_sep_relu (Activation (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_4_dw (DepthwiseConv2D) (None, 512, 6, 6)         4608      
_________________________________________________________________
conv5_4_dw_bn (BatchNormaliz (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_4_dw_relu (Activation) (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_4_sep (Conv2D)         (None, 512, 6, 6)         262144    
_________________________________________________________________
conv5_4_sep_bn (BatchNormali (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_4_sep_relu (Activation (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_5_dw (DepthwiseConv2D) (None, 512, 6, 6)         4608      
_________________________________________________________________
conv5_5_dw_bn (BatchNormaliz (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_5_dw_relu (Activation) (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_5_sep (Conv2D)         (None, 512, 6, 6)         262144    
_________________________________________________________________
conv5_5_sep_bn (BatchNormali (None, 512, 6, 6)         2048      
_________________________________________________________________
conv5_5_sep_relu (Activation (None, 512, 6, 6)         0         
_________________________________________________________________
conv5_6_dw (DepthwiseConv2D) (None, 512, 3, 3)         4608      
_________________________________________________________________
conv5_6_dw_bn (BatchNormaliz (None, 512, 3, 3)         2048      
_________________________________________________________________
conv5_6_dw_relu (Activation) (None, 512, 3, 3)         0         
_________________________________________________________________
conv5_6_sep (Conv2D)         (None, 1024, 2, 2)        524288    
_________________________________________________________________
conv5_6_sep_bn (BatchNormali (None, 1024, 2, 2)        4096      
_________________________________________________________________
conv5_6_sep_relu (Activation (None, 1024, 2, 2)        0         
_________________________________________________________________
conv6_dw (DepthwiseConv2D)   (None, 1024, 2, 2)        9216      
_________________________________________________________________
conv6_dw_bn (BatchNormalizat (None, 1024, 2, 2)        4096      
_________________________________________________________________
conv6_dw_relu (Activation)   (None, 1024, 2, 2)        0         
_________________________________________________________________
conv6_sep (Conv2D)           (None, 1024, 2, 2)        1048576   
_________________________________________________________________
conv6_sep_bn (BatchNormaliza (None, 1024, 2, 2)        4096      
_________________________________________________________________
conv6_sep_relu (Activation)  (None, 1024, 2, 2)        0         
_________________________________________________________________
pool6 (GlobalAveragePooling2 (None, 1024)              0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 1024, 1, 1)        0         
_________________________________________________________________
fc7_my_10 (Conv2D)           (None, 20, 1, 1)          20500     
_________________________________________________________________
reshape_2 (Reshape)          (None, 10, 2)             0         
_________________________________________________________________
probs (Softmax)              (None, 10, 2)             0         
=================================================================
Total params: 3,249,364
Trainable params: 3,227,476
Non-trainable params: 21,888
_________________________________________________________________
