{"class_name": "Model", "config": {"name": "MobileNet_v1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 720, 768], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"name": "conv1_bn", "class_name": "BatchNormalization", "config": {"name": "conv1_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv1_relu", "class_name": "Activation", "config": {"name": "conv1_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]]}, {"name": "conv2_1_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv2_1_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"name": "conv2_1_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_1_dw", 0, 0, {}]]]}, {"name": "conv2_1_dw_relu", "class_name": "Activation", "config": {"name": "conv2_1_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_1_dw_bn", 0, 0, {}]]]}, {"name": "conv2_1_sep", "class_name": "Conv2D", "config": {"name": "conv2_1_sep", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_1_dw_relu", 0, 0, {}]]]}, {"name": "conv2_1_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_1_sep", 0, 0, {}]]]}, {"name": "conv2_1_sep_relu", "class_name": "Activation", "config": {"name": "conv2_1_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_1_sep_bn", 0, 0, {}]]]}, {"name": "conv2_2_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv2_2_dw", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv2_1_sep_relu", 0, 0, {}]]]}, {"name": "conv2_2_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_2_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_2_dw", 0, 0, {}]]]}, {"name": "conv2_2_dw_relu", "class_name": "Activation", "config": {"name": "conv2_2_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_2_dw_bn", 0, 0, {}]]]}, {"name": "conv2_2_sep", "class_name": "Conv2D", "config": {"name": "conv2_2_sep", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_2_dw_relu", 0, 0, {}]]]}, {"name": "conv2_2_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_2_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_2_sep", 0, 0, {}]]]}, {"name": "conv2_2_sep_relu", "class_name": "Activation", "config": {"name": "conv2_2_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2_2_sep_bn", 0, 0, {}]]]}, {"name": "conv3_1_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv3_1_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv2_2_sep_relu", 0, 0, {}]]]}, {"name": "conv3_1_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_1_dw", 0, 0, {}]]]}, {"name": "conv3_1_dw_relu", "class_name": "Activation", "config": {"name": "conv3_1_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_1_dw_bn", 0, 0, {}]]]}, {"name": "conv3_1_sep", "class_name": "Conv2D", "config": {"name": "conv3_1_sep", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_1_dw_relu", 0, 0, {}]]]}, {"name": "conv3_1_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_1_sep", 0, 0, {}]]]}, {"name": "conv3_1_sep_relu", "class_name": "Activation", "config": {"name": "conv3_1_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_1_sep_bn", 0, 0, {}]]]}, {"name": "conv3_2_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv3_2_dw", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv3_1_sep_relu", 0, 0, {}]]]}, {"name": "conv3_2_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_2_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_2_dw", 0, 0, {}]]]}, {"name": "conv3_2_dw_relu", "class_name": "Activation", "config": {"name": "conv3_2_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_2_dw_bn", 0, 0, {}]]]}, {"name": "conv3_2_sep", "class_name": "Conv2D", "config": {"name": "conv3_2_sep", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_2_dw_relu", 0, 0, {}]]]}, {"name": "conv3_2_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv3_2_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_2_sep", 0, 0, {}]]]}, {"name": "conv3_2_sep_relu", "class_name": "Activation", "config": {"name": "conv3_2_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv3_2_sep_bn", 0, 0, {}]]]}, {"name": "conv4_1_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv4_1_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv3_2_sep_relu", 0, 0, {}]]]}, {"name": "conv4_1_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_1_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_1_dw", 0, 0, {}]]]}, {"name": "conv4_1_dw_relu", "class_name": "Activation", "config": {"name": "conv4_1_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4_1_dw_bn", 0, 0, {}]]]}, {"name": "conv4_1_sep", "class_name": "Conv2D", "config": {"name": "conv4_1_sep", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_1_dw_relu", 0, 0, {}]]]}, {"name": "conv4_1_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_1_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_1_sep", 0, 0, {}]]]}, {"name": "conv4_1_sep_relu", "class_name": "Activation", "config": {"name": "conv4_1_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4_1_sep_bn", 0, 0, {}]]]}, {"name": "conv4_2_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv4_2_dw", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv4_1_sep_relu", 0, 0, {}]]]}, {"name": "conv4_2_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_2_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_2_dw", 0, 0, {}]]]}, {"name": "conv4_2_dw_relu", "class_name": "Activation", "config": {"name": "conv4_2_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4_2_dw_bn", 0, 0, {}]]]}, {"name": "conv4_2_sep", "class_name": "Conv2D", "config": {"name": "conv4_2_sep", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_2_dw_relu", 0, 0, {}]]]}, {"name": "conv4_2_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv4_2_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_2_sep", 0, 0, {}]]]}, {"name": "conv4_2_sep_relu", "class_name": "Activation", "config": {"name": "conv4_2_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv4_2_sep_bn", 0, 0, {}]]]}, {"name": "conv5_1_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv5_1_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv4_2_sep_relu", 0, 0, {}]]]}, {"name": "conv5_1_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_1_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_1_dw", 0, 0, {}]]]}, {"name": "conv5_1_dw_relu", "class_name": "Activation", "config": {"name": "conv5_1_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_1_dw_bn", 0, 0, {}]]]}, {"name": "conv5_1_sep", "class_name": "Conv2D", "config": {"name": "conv5_1_sep", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_1_dw_relu", 0, 0, {}]]]}, {"name": "conv5_1_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_1_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_1_sep", 0, 0, {}]]]}, {"name": "conv5_1_sep_relu", "class_name": "Activation", "config": {"name": "conv5_1_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_1_sep_bn", 0, 0, {}]]]}, {"name": "conv5_2_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv5_2_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv5_1_sep_relu", 0, 0, {}]]]}, {"name": "conv5_2_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_2_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_2_dw", 0, 0, {}]]]}, {"name": "conv5_2_dw_relu", "class_name": "Activation", "config": {"name": "conv5_2_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_2_dw_bn", 0, 0, {}]]]}, {"name": "conv5_2_sep", "class_name": "Conv2D", "config": {"name": "conv5_2_sep", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_2_dw_relu", 0, 0, {}]]]}, {"name": "conv5_2_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_2_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_2_sep", 0, 0, {}]]]}, {"name": "conv5_2_sep_relu", "class_name": "Activation", "config": {"name": "conv5_2_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_2_sep_bn", 0, 0, {}]]]}, {"name": "conv5_3_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv5_3_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv5_2_sep_relu", 0, 0, {}]]]}, {"name": "conv5_3_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_3_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_3_dw", 0, 0, {}]]]}, {"name": "conv5_3_dw_relu", "class_name": "Activation", "config": {"name": "conv5_3_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_3_dw_bn", 0, 0, {}]]]}, {"name": "conv5_3_sep", "class_name": "Conv2D", "config": {"name": "conv5_3_sep", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_3_dw_relu", 0, 0, {}]]]}, {"name": "conv5_3_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_3_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_3_sep", 0, 0, {}]]]}, {"name": "conv5_3_sep_relu", "class_name": "Activation", "config": {"name": "conv5_3_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_3_sep_bn", 0, 0, {}]]]}, {"name": "conv5_4_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv5_4_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv5_3_sep_relu", 0, 0, {}]]]}, {"name": "conv5_4_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_4_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_4_dw", 0, 0, {}]]]}, {"name": "conv5_4_dw_relu", "class_name": "Activation", "config": {"name": "conv5_4_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_4_dw_bn", 0, 0, {}]]]}, {"name": "conv5_4_sep", "class_name": "Conv2D", "config": {"name": "conv5_4_sep", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_4_dw_relu", 0, 0, {}]]]}, {"name": "conv5_4_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_4_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_4_sep", 0, 0, {}]]]}, {"name": "conv5_4_sep_relu", "class_name": "Activation", "config": {"name": "conv5_4_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_4_sep_bn", 0, 0, {}]]]}, {"name": "conv5_5_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv5_5_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv5_4_sep_relu", 0, 0, {}]]]}, {"name": "conv5_5_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_5_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_5_dw", 0, 0, {}]]]}, {"name": "conv5_5_dw_relu", "class_name": "Activation", "config": {"name": "conv5_5_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_5_dw_bn", 0, 0, {}]]]}, {"name": "conv5_5_sep", "class_name": "Conv2D", "config": {"name": "conv5_5_sep", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_5_dw_relu", 0, 0, {}]]]}, {"name": "conv5_5_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_5_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_5_sep", 0, 0, {}]]]}, {"name": "conv5_5_sep_relu", "class_name": "Activation", "config": {"name": "conv5_5_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_5_sep_bn", 0, 0, {}]]]}, {"name": "conv5_6_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv5_6_dw", "trainable": true, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv5_5_sep_relu", 0, 0, {}]]]}, {"name": "conv5_6_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_6_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_6_dw", 0, 0, {}]]]}, {"name": "conv5_6_dw_relu", "class_name": "Activation", "config": {"name": "conv5_6_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_6_dw_bn", 0, 0, {}]]]}, {"name": "conv5_6_sep", "class_name": "Conv2D", "config": {"name": "conv5_6_sep", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv5_6_dw_relu", 0, 0, {}]]]}, {"name": "conv5_6_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv5_6_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv5_6_sep", 0, 0, {}]]]}, {"name": "conv5_6_sep_relu", "class_name": "Activation", "config": {"name": "conv5_6_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv5_6_sep_bn", 0, 0, {}]]]}, {"name": "conv6_dw", "class_name": "DepthwiseConv2D", "config": {"name": "conv6_dw", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "depthwise_constraint": null}, "inbound_nodes": [[["conv5_6_sep_relu", 0, 0, {}]]]}, {"name": "conv6_dw_bn", "class_name": "BatchNormalization", "config": {"name": "conv6_dw_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv6_dw", 0, 0, {}]]]}, {"name": "conv6_dw_relu", "class_name": "Activation", "config": {"name": "conv6_dw_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv6_dw_bn", 0, 0, {}]]]}, {"name": "conv6_sep", "class_name": "Conv2D", "config": {"name": "conv6_sep", "trainable": true, "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv6_dw_relu", 0, 0, {}]]]}, {"name": "conv6_sep_bn", "class_name": "BatchNormalization", "config": {"name": "conv6_sep_bn", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv6_sep", 0, 0, {}]]]}, {"name": "conv6_sep_relu", "class_name": "Activation", "config": {"name": "conv6_sep_relu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv6_sep_bn", 0, 0, {}]]]}, {"name": "pool6", "class_name": "GlobalAveragePooling2D", "config": {"name": "pool6", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["conv6_sep_relu", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1024, 1, 1]}, "inbound_nodes": [[["pool6", 0, 0, {}]]]}, {"name": "fc7_my_10", "class_name": "Conv2D", "config": {"name": "fc7_my_10", "trainable": true, "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [10, 2]}, "inbound_nodes": [[["fc7_my_10", 0, 0, {}]]]}, {"name": "probs", "class_name": "Softmax", "config": {"name": "probs", "trainable": true, "axis": -1}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["probs", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}